; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p2---int100n150-m25---int100c150---s52---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level24 level25 level49)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level25 level25 level50)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level26 level25 level51)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level27 level25 level52)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level17 level45)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level28 level25 level53)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level17 level46)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level29 level25 level54)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level17 level47)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level30 level25 level55)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level17 level48)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level31 level25 level56)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level17 level49)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level32 level25 level57)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level17 level50)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level33 level25 level58)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level17 level51)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level34 level25 level59)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level17 level52)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level35 level25 level60)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level17 level53)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level36 level25 level61)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level17 level54)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level37 level25 level62)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level17 level55)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level38 level25 level63)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level17 level56)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level39 level25 level64)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level17 level57)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level40 level25 level65)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level17 level58)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level41 level25 level66)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level17 level59)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level42 level25 level67)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level17 level60)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level43 level25 level68)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level17 level61)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level44 level25 level69)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level17 level62)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level45 level25 level70)
(sum level46 level4 level50)
(sum level46 level6 level52)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level17 level63)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level46 level25 level71)
(sum level47 level4 level51)
(sum level47 level6 level53)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level17 level64)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level47 level25 level72)
(sum level48 level4 level52)
(sum level48 level6 level54)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level17 level65)
(sum level48 level20 level68)
(sum level48 level21 level69)
(sum level48 level25 level73)
(sum level49 level4 level53)
(sum level49 level6 level55)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level17 level66)
(sum level49 level20 level69)
(sum level49 level21 level70)
(sum level49 level25 level74)
(sum level50 level4 level54)
(sum level50 level6 level56)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level17 level67)
(sum level50 level20 level70)
(sum level50 level21 level71)
(sum level50 level25 level75)
(sum level51 level4 level55)
(sum level51 level6 level57)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level17 level68)
(sum level51 level20 level71)
(sum level51 level21 level72)
(sum level51 level25 level76)
(sum level52 level4 level56)
(sum level52 level6 level58)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level17 level69)
(sum level52 level20 level72)
(sum level52 level21 level73)
(sum level52 level25 level77)
(sum level53 level4 level57)
(sum level53 level6 level59)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level17 level70)
(sum level53 level20 level73)
(sum level53 level21 level74)
(sum level53 level25 level78)
(sum level54 level4 level58)
(sum level54 level6 level60)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level17 level71)
(sum level54 level20 level74)
(sum level54 level21 level75)
(sum level54 level25 level79)
(sum level55 level4 level59)
(sum level55 level6 level61)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level17 level72)
(sum level55 level20 level75)
(sum level55 level21 level76)
(sum level55 level25 level80)
(sum level56 level4 level60)
(sum level56 level6 level62)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level56 level17 level73)
(sum level56 level20 level76)
(sum level56 level21 level77)
(sum level56 level25 level81)
(sum level57 level4 level61)
(sum level57 level6 level63)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level57 level17 level74)
(sum level57 level20 level77)
(sum level57 level21 level78)
(sum level57 level25 level82)
(sum level58 level4 level62)
(sum level58 level6 level64)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level58 level17 level75)
(sum level58 level20 level78)
(sum level58 level21 level79)
(sum level58 level25 level83)
(sum level59 level4 level63)
(sum level59 level6 level65)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level59 level15 level74)
(sum level59 level17 level76)
(sum level59 level20 level79)
(sum level59 level21 level80)
(sum level59 level25 level84)
(sum level60 level4 level64)
(sum level60 level6 level66)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level60 level15 level75)
(sum level60 level17 level77)
(sum level60 level20 level80)
(sum level60 level21 level81)
(sum level60 level25 level85)
(sum level61 level4 level65)
(sum level61 level6 level67)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level61 level15 level76)
(sum level61 level17 level78)
(sum level61 level20 level81)
(sum level61 level21 level82)
(sum level61 level25 level86)
(sum level62 level4 level66)
(sum level62 level6 level68)
(sum level62 level13 level75)
(sum level62 level14 level76)
(sum level62 level15 level77)
(sum level62 level17 level79)
(sum level62 level20 level82)
(sum level62 level21 level83)
(sum level62 level25 level87)
(sum level63 level4 level67)
(sum level63 level6 level69)
(sum level63 level13 level76)
(sum level63 level14 level77)
(sum level63 level15 level78)
(sum level63 level17 level80)
(sum level63 level20 level83)
(sum level63 level21 level84)
(sum level63 level25 level88)
(sum level64 level4 level68)
(sum level64 level6 level70)
(sum level64 level13 level77)
(sum level64 level14 level78)
(sum level64 level15 level79)
(sum level64 level17 level81)
(sum level64 level20 level84)
(sum level64 level21 level85)
(sum level64 level25 level89)
(sum level65 level4 level69)
(sum level65 level6 level71)
(sum level65 level13 level78)
(sum level65 level14 level79)
(sum level65 level15 level80)
(sum level65 level17 level82)
(sum level65 level20 level85)
(sum level65 level21 level86)
(sum level65 level25 level90)
(sum level66 level4 level70)
(sum level66 level6 level72)
(sum level66 level13 level79)
(sum level66 level14 level80)
(sum level66 level15 level81)
(sum level66 level17 level83)
(sum level66 level20 level86)
(sum level66 level21 level87)
(sum level66 level25 level91)
(sum level67 level4 level71)
(sum level67 level6 level73)
(sum level67 level13 level80)
(sum level67 level14 level81)
(sum level67 level15 level82)
(sum level67 level17 level84)
(sum level67 level20 level87)
(sum level67 level21 level88)
(sum level67 level25 level92)
(sum level68 level4 level72)
(sum level68 level6 level74)
(sum level68 level13 level81)
(sum level68 level14 level82)
(sum level68 level15 level83)
(sum level68 level17 level85)
(sum level68 level20 level88)
(sum level68 level21 level89)
(sum level68 level25 level93)
(sum level69 level4 level73)
(sum level69 level6 level75)
(sum level69 level13 level82)
(sum level69 level14 level83)
(sum level69 level15 level84)
(sum level69 level17 level86)
(sum level69 level20 level89)
(sum level69 level21 level90)
(sum level69 level25 level94)
(sum level70 level4 level74)
(sum level70 level6 level76)
(sum level70 level13 level83)
(sum level70 level14 level84)
(sum level70 level15 level85)
(sum level70 level17 level87)
(sum level70 level20 level90)
(sum level70 level21 level91)
(sum level70 level25 level95)
(sum level71 level4 level75)
(sum level71 level6 level77)
(sum level71 level13 level84)
(sum level71 level14 level85)
(sum level71 level15 level86)
(sum level71 level17 level88)
(sum level71 level20 level91)
(sum level71 level21 level92)
(sum level71 level25 level96)
(sum level72 level4 level76)
(sum level72 level6 level78)
(sum level72 level13 level85)
(sum level72 level14 level86)
(sum level72 level15 level87)
(sum level72 level17 level89)
(sum level72 level20 level92)
(sum level72 level21 level93)
(sum level72 level25 level97)
(sum level73 level4 level77)
(sum level73 level6 level79)
(sum level73 level13 level86)
(sum level73 level14 level87)
(sum level73 level15 level88)
(sum level73 level17 level90)
(sum level73 level20 level93)
(sum level73 level21 level94)
(sum level73 level25 level98)
(sum level74 level4 level78)
(sum level74 level6 level80)
(sum level74 level13 level87)
(sum level74 level14 level88)
(sum level74 level15 level89)
(sum level74 level17 level91)
(sum level74 level20 level94)
(sum level74 level21 level95)
(sum level74 level25 level99)
(sum level75 level4 level79)
(sum level75 level6 level81)
(sum level75 level13 level88)
(sum level75 level14 level89)
(sum level75 level15 level90)
(sum level75 level17 level92)
(sum level75 level20 level95)
(sum level75 level21 level96)
(sum level75 level25 level100)
(sum level76 level4 level80)
(sum level76 level6 level82)
(sum level76 level13 level89)
(sum level76 level14 level90)
(sum level76 level15 level91)
(sum level76 level17 level93)
(sum level76 level20 level96)
(sum level76 level21 level97)
(sum level76 level25 level101)
(sum level77 level4 level81)
(sum level77 level6 level83)
(sum level77 level13 level90)
(sum level77 level14 level91)
(sum level77 level15 level92)
(sum level77 level17 level94)
(sum level77 level20 level97)
(sum level77 level21 level98)
(sum level77 level25 level102)
(sum level78 level4 level82)
(sum level78 level6 level84)
(sum level78 level13 level91)
(sum level78 level14 level92)
(sum level78 level15 level93)
(sum level78 level17 level95)
(sum level78 level20 level98)
(sum level78 level21 level99)
(sum level78 level25 level103)
(sum level79 level4 level83)
(sum level79 level6 level85)
(sum level79 level13 level92)
(sum level79 level14 level93)
(sum level79 level15 level94)
(sum level79 level17 level96)
(sum level79 level20 level99)
(sum level79 level21 level100)
(sum level79 level25 level104)
(sum level80 level4 level84)
(sum level80 level6 level86)
(sum level80 level13 level93)
(sum level80 level14 level94)
(sum level80 level15 level95)
(sum level80 level17 level97)
(sum level80 level20 level100)
(sum level80 level21 level101)
(sum level80 level25 level105)
(sum level81 level4 level85)
(sum level81 level6 level87)
(sum level81 level13 level94)
(sum level81 level14 level95)
(sum level81 level15 level96)
(sum level81 level17 level98)
(sum level81 level20 level101)
(sum level81 level21 level102)
(sum level81 level25 level106)
(sum level82 level4 level86)
(sum level82 level6 level88)
(sum level82 level13 level95)
(sum level82 level14 level96)
(sum level82 level15 level97)
(sum level82 level17 level99)
(sum level82 level20 level102)
(sum level82 level21 level103)
(sum level82 level25 level107)
(sum level83 level4 level87)
(sum level83 level6 level89)
(sum level83 level13 level96)
(sum level83 level14 level97)
(sum level83 level15 level98)
(sum level83 level17 level100)
(sum level83 level20 level103)
(sum level83 level21 level104)
(sum level83 level25 level108)
(sum level84 level4 level88)
(sum level84 level6 level90)
(sum level84 level13 level97)
(sum level84 level14 level98)
(sum level84 level15 level99)
(sum level84 level17 level101)
(sum level84 level20 level104)
(sum level84 level21 level105)
(sum level84 level25 level109)
(sum level85 level4 level89)
(sum level85 level6 level91)
(sum level85 level13 level98)
(sum level85 level14 level99)
(sum level85 level15 level100)
(sum level85 level17 level102)
(sum level85 level20 level105)
(sum level85 level21 level106)
(sum level86 level4 level90)
(sum level86 level6 level92)
(sum level86 level13 level99)
(sum level86 level14 level100)
(sum level86 level15 level101)
(sum level86 level17 level103)
(sum level86 level20 level106)
(sum level86 level21 level107)
(sum level87 level4 level91)
(sum level87 level6 level93)
(sum level87 level13 level100)
(sum level87 level14 level101)
(sum level87 level15 level102)
(sum level87 level17 level104)
(sum level87 level20 level107)
(sum level87 level21 level108)
(sum level88 level4 level92)
(sum level88 level6 level94)
(sum level88 level13 level101)
(sum level88 level14 level102)
(sum level88 level15 level103)
(sum level88 level17 level105)
(sum level88 level20 level108)
(sum level88 level21 level109)
(sum level89 level4 level93)
(sum level89 level6 level95)
(sum level89 level13 level102)
(sum level89 level14 level103)
(sum level89 level15 level104)
(sum level89 level17 level106)
(sum level89 level20 level109)
(sum level90 level4 level94)
(sum level90 level6 level96)
(sum level90 level13 level103)
(sum level90 level14 level104)
(sum level90 level15 level105)
(sum level90 level17 level107)
(sum level91 level4 level95)
(sum level91 level6 level97)
(sum level91 level13 level104)
(sum level91 level14 level105)
(sum level91 level15 level106)
(sum level91 level17 level108)
(sum level92 level4 level96)
(sum level92 level6 level98)
(sum level92 level13 level105)
(sum level92 level14 level106)
(sum level92 level15 level107)
(sum level92 level17 level109)
(sum level93 level4 level97)
(sum level93 level6 level99)
(sum level93 level13 level106)
(sum level93 level14 level107)
(sum level93 level15 level108)
(sum level94 level4 level98)
(sum level94 level6 level100)
(sum level94 level13 level107)
(sum level94 level14 level108)
(sum level94 level15 level109)
(sum level95 level4 level99)
(sum level95 level6 level101)
(sum level95 level13 level108)
(sum level95 level14 level109)
(sum level96 level4 level100)
(sum level96 level6 level102)
(sum level96 level13 level109)
(sum level97 level4 level101)
(sum level97 level6 level103)
(sum level98 level4 level102)
(sum level98 level6 level104)
(sum level99 level4 level103)
(sum level99 level6 level105)
(sum level100 level4 level104)
(sum level100 level6 level106)
(sum level101 level4 level105)
(sum level101 level6 level107)
(sum level102 level4 level106)
(sum level102 level6 level108)
(sum level103 level4 level107)
(sum level103 level6 level109)
(sum level104 level4 level108)
(sum level105 level4 level109)

(connected l0 l2)
(fuelcost level20 l0 l2)
(connected l0 l3)
(fuelcost level21 l0 l3)
(connected l0 l4)
(fuelcost level13 l0 l4)
(connected l0 l5)
(fuelcost level17 l0 l5)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l1 l6)
(fuelcost level4 l1 l6)
(connected l2 l0)
(fuelcost level20 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)
(connected l2 l3)
(fuelcost level14 l2 l3)
(connected l2 l4)
(fuelcost level17 l2 l4)
(connected l2 l6)
(fuelcost level6 l2 l6)
(connected l2 l7)
(fuelcost level4 l2 l7)
(connected l3 l0)
(fuelcost level21 l3 l0)
(connected l3 l2)
(fuelcost level14 l3 l2)
(connected l3 l4)
(fuelcost level25 l3 l4)
(connected l4 l0)
(fuelcost level13 l4 l0)
(connected l4 l2)
(fuelcost level17 l4 l2)
(connected l4 l3)
(fuelcost level25 l4 l3)
(connected l4 l6)
(fuelcost level15 l4 l6)
(connected l5 l0)
(fuelcost level17 l5 l0)
(connected l6 l1)
(fuelcost level4 l6 l1)
(connected l6 l2)
(fuelcost level6 l6 l2)
(connected l6 l4)
(fuelcost level15 l6 l4)
(connected l7 l2)
(fuelcost level4 l7 l2)

(at t0 l4)
(fuel t0 level109)
(= (total-cost) 0)

(at p0 l0)
(at p1 l6)
)

(:goal
(and
(at p0 l5)
(at p1 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l6 level94 level15 level109)
   deleted: (at t0 l4) (fuel t0 level109)
   added: (at t0 l6) (fuel t0 level94)
   goals met: 0 of 2
2. (load p1 t0 l6)
   deleted: (at p1 l6)
   added: (in p1 t0)
   goals met: 0 of 2
3. (drive t0 l6 l2 level88 level6 level94)
   deleted: (at t0 l6) (fuel t0 level94)
   added: (at t0 l2) (fuel t0 level88)
   goals met: 0 of 2
4. (drive t0 l2 l3 level74 level14 level88)
   deleted: (at t0 l2) (fuel t0 level88)
   added: (at t0 l3) (fuel t0 level74)
   goals met: 0 of 2
5. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 1 of 2
6. (drive t0 l3 l0 level53 level21 level74)
   deleted: (at t0 l3) (fuel t0 level74)
   added: (at t0 l0) (fuel t0 level53)
   goals met: 1 of 2
7. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 1 of 2
8. (drive t0 l0 l5 level36 level17 level53)
   deleted: (at t0 l0) (fuel t0 level53)
   added: (at t0 l5) (fuel t0 level36)
   goals met: 1 of 2
9. (unload p0 t0 l5)
   deleted: (in p0 t0)
   added: (at p0 l5)
   goals met: 2 of 2
